import pandas as pd
import os
path='C:\\Users\Administrator\Desktop\秀秀数据\待做\\731数据\查看数据'
df=pd.read_excel(os.path.join(path,'填坑.xlsx'),dtype=object,)
df.loc[:,'截止日期']=pd.to_datetime(df['截止日期']).dt.date
# order=['证券代码','截止日期','1股东大会出席股份比例(%)','2董事长与总经理兼任情况评分','3独立董事比例(%)','4董事会成员有无持股评分',
#        '5高管是否持股评分','6机构投资者持股比例','7净资产收益率','9经营现金净流量/营业总收入','11资产负债率',
#        '12总利润/总负债','14流动资产周转率','15总资产周转率A','16营业总收入增长率','17营业利润增长率','18归属于母公司净利润增长率',
#        '19总资产增长率','22内部控制审计意见评分','23审计内部控制的会计师事务所排名评分','24内部控制缺陷及整改情况评分','27一季度报告及时性评分',
#        '28二季度报告及时性评分','29三季度报告及时性评分','30年报告及时性评分','33第一大股东持股变化评分','39召开方式分数','40表决方式分数']
l=df['证券代码'].unique()
print(l)
def get_ID(x):
    for i,v in  enumerate(l):
        if x['证券代码'] ==v:
            return i+1

df.loc[:,'ID']=df.apply(get_ID,axis=1)
print(df['ID'])
order=['ID','证券代码','截止日期','股东大会出席股份比例(%)','董事长与总经理兼任情况评分','独立董事比例(%)','董事会成员有无持股评分',
       '高管是否持股评分','机构投资者持股比例','净资产收益率','经营现金净流量/营业总收入','资产负债率',
       '总利润/总负债','流动资产周转率','总资产周转率A','营业总收入增长率','营业利润增长率','归属于母公司净利润增长率',
       '总资产增长率','内部控制审计意见评分','审计内部控制的会计师事务所排名评分','内部控制缺陷及整改情况评分','一季度报告及时性评分',
       '二季度报告及时性评分','三季度报告及时性评分','年报告及时性评分','第一大股东持股变化评分','召开方式分数','表决方式分数']
df=df[order]

df.rename(columns={'ID':'ID','证券代码':'证券代码','截止日期':'截止日期','股东大会出席股份比例(%)':'1股东大会出席股份比例(%)','董事长与总经理兼任情况评分':'2董事长与总经理兼任情况评分','独立董事比例(%)':'3独立董事比例(%)','董事会成员有无持股评分':'4董事会成员有无持股评分',
       '高管是否持股评分':'5高管是否持股评分','机构投资者持股比例':'6机构投资者持股比例','净资产收益率':'7净资产收益率','经营现金净流量/营业总收入':'9经营现金净流量/营业总收入','资产负债率':'11资产负债率',
       '总利润/总负债':'12总利润/总负债','流动资产周转率':'14流动资产周转率','总资产周转率A':'15总资产周转率A','营业总收入增长率':'16营业总收入增长率','营业利润增长率':'17营业利润增长率','归属于母公司净利润增长率':'18归属于母公司净利润增长率',
       '总资产增长率':'19总资产增长率','内部控制审计意见评分':'22内部控制审计意见评分','审计内部控制的会计师事务所排名评分':'23审计内部控制的会计师事务所排名评分','内部控制缺陷及整改情况评分':'24内部控制缺陷及整改情况评分','一季度报告及时性评分':'27一季度报告及时性评分',
       '二季度报告及时性评分':'28二季度报告及时性评分','三季度报告及时性评分':'29三季度报告及时性评分','年报告及时性评分':'30年报告及时性评分','第一大股东持股变化评分':'33第一大股东持股变化评分','召开方式分数':'39召开方式分数','表决方式分数':'40表决方式分数'},inplace=True)




df.to_excel(os.path.join(path,'实验.xlsx'))